#include "common.h"

typedef struct OverlayTable {
/* 0x00 */ u8* romStart;
/* 0x04 */ u8* romEnd;
/* 0x08 */ u8* vramStart;
/* 0x0C */ u8* textVramStart;
/* 0x10 */ u8* textVramEnd;
/* 0x14 */ u8* dataVramStart;
/* 0x18 */ u8* dataVramEnd;
/* 0x1C */ u8* bssVramStart;
/* 0x20 */ u8* bssVramEnd;
} OverlayTable; //sizeof 0x24

u8 D_800962F0_96EF0[] = {0, 0, 0, 0};

#define OVL_ENTRY(name) \
    {name##_ROM_START, name##_ROM_END, name##_VRAM, name##_TEXT_START, name##_TEXT_END, name##_DATA_START, name##_RODATA_END, name##_BSS_START, name##_BSS_END}

OverlayTable _ovltbl[] = {
    OVL_ENTRY(name_00),
    OVL_ENTRY(name_01),
    OVL_ENTRY(name_02),
    OVL_ENTRY(name_03),
    OVL_ENTRY(name_04),
    OVL_ENTRY(name_05),
    OVL_ENTRY(name_06),
    OVL_ENTRY(name_07),
    OVL_ENTRY(name_08),
    OVL_ENTRY(name_09),
    OVL_ENTRY(name_0A),
    OVL_ENTRY(name_0B),
    OVL_ENTRY(name_0C),
    OVL_ENTRY(name_0D),
    OVL_ENTRY(name_0E),
    OVL_ENTRY(name_0F),
    OVL_ENTRY(name_10),
    OVL_ENTRY(name_11),
    OVL_ENTRY(name_12),
    OVL_ENTRY(name_13),
    OVL_ENTRY(name_14),
    OVL_ENTRY(name_15),
    OVL_ENTRY(name_16),
    OVL_ENTRY(name_17),
    OVL_ENTRY(name_18),
    OVL_ENTRY(name_19),
    OVL_ENTRY(name_1A),
    OVL_ENTRY(name_1B),
    OVL_ENTRY(name_1C),
    OVL_ENTRY(name_1D),
    OVL_ENTRY(name_1E),
    OVL_ENTRY(name_1F),
    OVL_ENTRY(name_20),
    OVL_ENTRY(name_21),
    OVL_ENTRY(name_22),
    OVL_ENTRY(name_23),
    OVL_ENTRY(name_24),
    OVL_ENTRY(name_25),
    OVL_ENTRY(name_26),
    OVL_ENTRY(name_27),
    OVL_ENTRY(name_28),
    OVL_ENTRY(name_29),
    OVL_ENTRY(name_2A),
    OVL_ENTRY(name_2B),
    OVL_ENTRY(name_2C),
    OVL_ENTRY(name_2D),
    OVL_ENTRY(name_2E),
    OVL_ENTRY(name_2F),
    OVL_ENTRY(name_30),
    OVL_ENTRY(name_31),
    OVL_ENTRY(name_32),
    OVL_ENTRY(name_33),
    OVL_ENTRY(name_34),
    OVL_ENTRY(name_35),
    OVL_ENTRY(name_36),
    OVL_ENTRY(name_37),
    OVL_ENTRY(name_38),
    OVL_ENTRY(name_39),
    OVL_ENTRY(name_3A),
    OVL_ENTRY(name_3B),
    OVL_ENTRY(name_3C),
    OVL_ENTRY(name_3D),
    OVL_ENTRY(name_3E),
    OVL_ENTRY(name_3F),
    OVL_ENTRY(name_40),
    OVL_ENTRY(name_41),
    OVL_ENTRY(name_42),
    OVL_ENTRY(name_43),
    OVL_ENTRY(name_44),
    OVL_ENTRY(name_45),
    OVL_ENTRY(name_46),
    OVL_ENTRY(name_47),
    OVL_ENTRY(name_48),
    OVL_ENTRY(name_49),
    OVL_ENTRY(name_4A),
    OVL_ENTRY(name_4B),
    OVL_ENTRY(name_4C),
    OVL_ENTRY(name_4D),
    OVL_ENTRY(name_4E),
    OVL_ENTRY(name_4F),
    OVL_ENTRY(name_50),
    OVL_ENTRY(name_51),
    OVL_ENTRY(name_52),
    OVL_ENTRY(name_53),
    OVL_ENTRY(name_54),
    OVL_ENTRY(name_55),
    OVL_ENTRY(name_56),
    OVL_ENTRY(name_57),
    OVL_ENTRY(name_58),
    OVL_ENTRY(name_59),
    OVL_ENTRY(gate_guy_intro1),
    OVL_ENTRY(board_gate_guy),
    OVL_ENTRY(board_arrowhead_intro),
    OVL_ENTRY(board_pipesqueak_intro),
    OVL_ENTRY(board_blowhard_intro),
    OVL_ENTRY(name_5F),
    OVL_ENTRY(name_60),
    OVL_ENTRY(name_61),
    OVL_ENTRY(name_62),
    OVL_ENTRY(name_63),
    OVL_ENTRY(name_64),
    OVL_ENTRY(name_65),
    OVL_ENTRY(name_66),
    OVL_ENTRY(name_67),
    OVL_ENTRY(name_68),
    OVL_ENTRY(name_69),
    OVL_ENTRY(name_6A),
    OVL_ENTRY(name_6B),
    OVL_ENTRY(name_6C),
    OVL_ENTRY(name_6D),
    OVL_ENTRY(name_6E),
    OVL_ENTRY(name_6F),
    OVL_ENTRY(name_70),
    OVL_ENTRY(name_71),
    OVL_ENTRY(name_72),
    OVL_ENTRY(name_73),
    OVL_ENTRY(name_74),
    OVL_ENTRY(name_75),
    OVL_ENTRY(name_76),
    OVL_ENTRY(name_77),
    OVL_ENTRY(name_78),
    OVL_ENTRY(name_79),
    OVL_ENTRY(name_7A),
    OVL_ENTRY(name_7B),
    OVL_ENTRY(name_7C),
    OVL_ENTRY(name_7D),
    OVL_ENTRY(name_7E),
    OVL_ENTRY(name_7F)
};

OverlayTable _modeovltbl[] = {
    OVL_ENTRY(name_80),
    OVL_ENTRY(name_81),
    OVL_ENTRY(name_82)
};